Revit 2027 API
MasonryCMU.MasonryCMUPatternHeight Property
 The property labeled "Amount" from the "MasonryCMU" schema.
Namespace: Autodesk.Revit.DB.Visual
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static string MasonryCMUPatternHeight { get; }
Public Shared ReadOnly Property MasonryCMUPatternHeight As String
	Get
public:
static property String^ MasonryCMUPatternHeight {
	String^ get ();
}
static member MasonryCMUPatternHeight : string with get
Property Value
String
Remarks
 This property is of type "AssetPropertyDouble" within the range of "0, 2".
See Also
Reference
MasonryCMU Class
Autodesk.Revit.DB.Visual Namespace